import Cards from "../ui/Cards";

const productsList = [
  {
    h3: "محصولات پلیمری",
    p: "محصولات پلیمری صنعت پتروشیمی شامل طیف گسترده‌ای از مواد پلاستیکی و لاستیکی هستند که از مواد خام نفتی و گازی تولید می‌شوند. این محصولات شامل پلیمرهایی مانند پلی‌اتیلن، پلی‌پروپیلن، پلی‌استایرن، پلی‌وینیل کلراید و ... هستند که در صنایع مختلفی از جمله بسته‌بندی، خودروسازی، ساختمان‌سازی، و تولید لوازم خانگی کاربرد دارند. ",
  },
  {
    h3: "محصولات آروماتیک",
    p: "محصولات آروماتیک صنعت پتروشیمی شامل بنزن، تولوئن، زایلن‌ها (ارتوزایلن و پارازایلن) و سایر ترکیبات آروماتیکی هستند. این ترکیبات به عنوان مواد اولیه در تولید طیف گسترده‌ای از محصولات از جمله پلاستیک‌ها، رزین‌ها، الیاف مصنوعی، حلال‌ها، مواد شوینده، رنگ‌ها، داروها و بسیاری از مواد شیمیایی دیگر به کار می‌روند.",
  },
  {
    h3: "محصولات شیمیایی",
    p: "مواد اولیه شامل موادی مانند اتیلن، پروپیلن، بوتادین، بنزن، تولوئن و زایلن هستند که به عنوان خوراک برای تولید سایر محصولات پتروشیمی به کار می‌روند. ",
  },
];

function ProductsCard() {
  return <div className="section">
    <Cards items={productsList} />
  </div>;
}

export default ProductsCard;
