import Cards from "../ui/Cards";

const servicesList = [
  {
    h3: "تولید و عرضه محصولات شیمیایی پایه",
    p: "تولید و عرضه محصولات شیمیایی پایه، مواد اولیه پلاستیک، کودهای شیمیایی، مواد اولیه لاستیک، رزین‌ها، الیاف مصنوعی و بسیاری از مواد دیگر می‌شود.نقشی حیاتی در تامین نیازهای صنایع مختلف از جمله کشاورزی، خودروسازی، ساخت و ساز، نساجی و بسته‌بندی دارد. ",
  },
  {
    h3: "خدمات فنی و مهندسی",
    p: "این خدمات شامل طراحی، مهندسی، اجرا، راه‌اندازی و تعمیر و نگهداری واحدهای پتروشیمی و همچنین ارائه خدمات مشاوره‌ای در زمینه فناوری‌های پتروشیمی می‌شود.",
  },
  {
    h3: "تولید محصولات نهایی",
    p: "بسیاری از محصولات نهایی از جمله انواع پلاستیک‌ها، لاستیک‌ها، رزین‌ها، الیاف مصنوعی، چسب‌ها، رنگ‌ها، مواد شوینده و سموم دفع آفات نیز توسط واحدهای پتروشیمی تولید می‌شوند. ",
  },
];

function ServicesCard() {
  return <Cards items={servicesList} />;
}

export default ServicesCard;

