import Cards from "../ui/Cards";

const services = [
  {
    h3: "توليد كننده و توزيع كننده انواع گازهاي صنعتي",
    p: "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است..",
  },
  {
    h3: "حفاری چاه عمیق و نیمه عمیق",
    p: "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است..",
  },
  {
    h3: "نوار عایق و پوشش خطوط لوله",
    p: "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است..",
  },
];

function ServicesCard() {
  return <Cards items={services} />;
}

export default ServicesCard;
