import { createContext, useContext, useState } from "react";

const ItemsContext = createContext();

export function ItemsProvider({ children }) {
  const [products] = useState([
    {
      id: 11,
      h3: "محصولات پلیمری",
      p: "پلیمرها، درشت مولکول های آلی زنجیره ای هستند که از واکنش پلیمریزاسیون واحدهای مونومر تشکیل شده اند. تنوع ساختاری در آن ها بسیار بالا است به طوری که تمام صنایع امروزه از این مواد پلیمری برای ساخت محصولات متنوع و مدرن پلاستیکی استفاده می کنند. مصرف عمده مواد پلیمری در صنعت لاستیک و پلاستیک است. این مواد یکی از مهم ترین مشتقات نفتی به شمار می روند و در بازار با نام های مختلفی شناخته می شوند. پلی اتیلن، پلی پروپیلن، پلی اتیلن ترفتالات، پلی وینیل کلراید، پلی استایرن و اکریلونیتریل بوتادین استایرن پرکاربردترین پلیمرها صنعت نفت و پتروشیمی هستند..محصولات پلیمری صنعت پتروشیمی شامل طیف گسترده‌ای از مواد پلاستیکی و لاستیکی هستند که از مواد خام نفتی و گازی تولید می‌شوند. این محصولات شامل پلیمرهایی مانند پلی‌اتیلن، پلی‌پروپیلن، پلی‌استایرن، پلی‌وینیل کلراید و ... هستند که در صنایع مختلفی از جمله بسته‌بندی، خودروسازی، ساختمان‌سازی، و تولید لوازم خانگی کاربرد دارند. ",
      icon: "/polymer.png",
      image:"/polymerproducts.jpg"
    },
    {
      id: 12,
      h3: "محصولات آروماتیک",
      p: "آروماتیک به خانواده ای از ترکیبات آلی گفته می شود که در ساختار خود دارای حلقه با پیوند دوگانه هستند. آروماتیکها، دسته وسیعی از ترکیبات را تشکیل میدهند که شامل بنزن و مشتقات آن میباشند. برخی هیدروکربنهای آروماتیکی موجود در نفت خام عبارتند از: بنزن ، تولوئن ارتو- زایلن ، متا- زایلن ، پارا- زایلن ، نفتالین ، کومن و غیره. از محصولات آروماتیکی در تهیه و تولید پلی استرها، الیاف مصنوعی، رنگها، رزینها، بطریهای یکبار مصرف، نایلـــــون شوینده ها، ترکیبات دارویی، سموم دفع آفات، حالل صنعتی و ...استفاده می گردد..محصولات آروماتیک صنعت پتروشیمی شامل بنزن، تولوئن، زایلن‌ها (ارتوزایلن و پارازایلن) و سایر ترکیبات آروماتیکی هستند. این ترکیبات به عنوان مواد اولیه در تولید طیف گسترده‌ای از محصولات از جمله پلاستیک‌ها، رزین‌ها، الیاف مصنوعی، حلال‌ها، مواد شوینده، رنگ‌ها، داروها و بسیاری از مواد شیمیایی دیگر به کار می‌روند.",
      icon: "/aroma-oil.png",
      image:"/aromaticproducts.jpeg"
    },
    {
      id: 13,
      h3: "محصولات شیمیایی",
      p: "محصولات شیمیایی پایه : مواد شیمیایی پایه موادی هستند که برای تولید محصولات نهایی از آنها استفاده می شود.. این مواد شامل طیف گسترده ای از محصولات می شوند.مواد اولیه شامل موادی مانند اتیلن، پروپیلن، بوتادین، بنزن، تولوئن و زایلن هستند که به عنوان خوراک برای تولید سایر محصولات پتروشیمی به کار می‌روند. ",
      icon: "/chemical-icon-png-21431.png",
      image:"/chemicalproducts.jpg"
    },
  ]);

  const [services] = useState([
    {
      id: 1,
      h3: "تولید و عرضه محصولات شیمیایی پایه",
      p: "تولید و عرضه محصولات شیمیایی پایه، مواد اولیه پلاستیک، کودهای شیمیایی، مواد اولیه لاستیک، رزین‌ها، الیاف مصنوعی و بسیاری از مواد دیگر می‌شود.نقشی حیاتی در تامین نیازهای صنایع مختلف از جمله کشاورزی، خودروسازی، ساخت و ساز، نساجی و بسته‌بندی دارد. ",
    },
    {
      id: 2,
      h3: "خدمات فنی و مهندسی",
      p: "این خدمات شامل طراحی، مهندسی، اجرا، راه‌اندازی و تعمیر و نگهداری واحدهای پتروشیمی و همچنین ارائه خدمات مشاوره‌ای در زمینه فناوری‌های پتروشیمی می‌شود.",
    },
    {
      id: 3,
      h3: "تولید محصولات نهایی",
      p: "بسیاری از محصولات نهایی از جمله انواع پلاستیک‌ها، لاستیک‌ها، رزین‌ها، الیاف مصنوعی، چسب‌ها، رنگ‌ها، مواد شوینده و سموم دفع آفات نیز توسط واحدهای پتروشیمی تولید می‌شوند. ",
    },
  ]);

  const getItemById = (id, type) => {
    const items = type === "products" ? products : services;
    return items.find((item) => item.id === parseInt(id));
  };

  const value = {
    products,
    services,
    getItemById,
  };

  return (
    <ItemsContext.Provider value={value}>{children}</ItemsContext.Provider>
  );
}

export function useItems() {
  const context = useContext(ItemsContext);
  if (!context) {
    throw new Error("useItems must be used within an ItemsProvider");
  }
  return context;
}
